# Brewfile
# brew bundle install --file=macos/Brewfile

# ── tap ──────────────────────────────────────────────────────────────────────
tap "buo/cask-upgrade"

# ── CLI tools ─────────────────────────────────────────────────────────────────
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-filter-repo"
brew "jq"
brew "mas"
brew "nkf"
brew "pandoc"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "wget"

# ── メディア処理 ───────────────────────────────────────────────────────────────
brew "ffmpeg"

# ── macOS ユーティリティ ────────────────────────────────────────────────────────
brew "cliclick"
brew "dockutil"
brew "duti"
brew "lsusb"
brew "switchaudio-osx"

# ── PDF / LaTeX ──────────────────────────────────────────────────────────────
brew "diff-pdf"
brew "ghostscript"
brew "latex2rtf"
brew "latexdiff"
brew "latexindent"
brew "markdownlint-cli"
brew "pdfcrack"
brew "pdftk-java"

# ── セキュリティ ──────────────────────────────────────────────────────────────
brew "gitleaks"
brew "gnupg"
brew "gpgme"

# ── Language / Runtime ────────────────────────────────────────────────────────
brew "node"
brew "nodebrew"
brew "openjdk@11"
brew "php"
brew "pipx"
brew "pyenv"
brew "rbenv"
brew "ruby-build"

# ── 開発ツール ────────────────────────────────────────────────────────────────
brew "cmake"
brew "flyctl"
brew "postgresql@14"
brew "pre-commit"
brew "selenium-server"
brew "swiftformat"
brew "swiftlint"

# ── ライブラリ（依存関係） ────────────────────────────────────────────────────────
brew "aom"
brew "apr-util"
brew "boost"
brew "freetds"
brew "gettext"
brew "glib"
brew "gnutls"
brew "gobject-introspection"
brew "imagemagick"
brew "jpeg-xl"
brew "krb5"
brew "libass"
brew "libavif"
brew "libheif"
brew "libmicrohttpd"
brew "librist"
brew "librsvg"
brew "maxima"
brew "openjpeg"
brew "openssl@3"
brew "poppler"
brew "python-packaging"
brew "qt"
brew "tcl-tk"
brew "tesseract"
brew "unbound"
brew "webp"
brew "wimlib"
brew "wxmaxima"

# ── macOS アプリ（開発） ──────────────────────────────────────────────────────
cask "claude-code"
cask "db-browser-for-sqlite"
cask "iterm2"
cask "pycharm"
cask "sublime-text"
cask "visual-studio-code"
cask "visual-studio-code@insiders"

# ── macOS アプリ（生産性） ─────────────────────────────────────────────────────
cask "alfred"
cask "appcleaner"
cask "bettertouchtool"
cask "betterzip"
cask "copilot-cli"
cask "dash"
cask "deepl"
cask "logi-options+"
cask "monitorcontrol"
cask "obsidian"

# ── macOS アプリ（コミュニケーション） ──────────────────────────────────────────
cask "chatgpt"
cask "microsoft-teams"
cask "slack"
cask "zoom"

# ── macOS アプリ（クラウドストレージ） ──────────────────────────────────────────
cask "dropbox"
cask "google-drive"
cask "onedrive"

# ── macOS アプリ（ブラウザ） ──────────────────────────────────────────────────
cask "brave-browser"
cask "google-chrome"

# ── macOS アプリ（メディア・クリエイティブ） ─────────────────────────────────────
cask "audius"
cask "blender"
cask "burn"
cask "gimp"
cask "inkscape"
cask "shotcut"
cask "spotify"

# ── macOS アプリ（学術・LaTeX） ──────────────────────────────────────────────
cask "mactex"
cask "tex-live-utility"
cask "vesta"
cask "zotero"

# ── macOS アプリ（エンジニアリング） ────────────────────────────────────────────
cask "autodesk-fusion"
cask "ltspice"
cask "vnc-viewer"
cask "windows-app"
cask "wolfram-engine"

# ── Mac App Store ────────────────────────────────────────────────────────────
mas "Bitwarden", id: 1352778147
mas "Canary Mail", id: 1236045954
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "Lockera Widgets", id: 6466819847
mas "MARKETSPEED", id: 946680495
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Expert", id: 1055273043
mas "RunCat", id: 1429033973
mas "ToDo", id: 1498581975
mas "UpNote", id: 1398373917
mas "Xcode", id: 497799835
mas "スティッキーズ Pro", id: 1482080766

# ── VSCode 拡張機能 ───────────────────────────────────────────────────────────
vscode "3w36zj6.textlint"
vscode "anthropic.claude-code"
vscode "bierner.markdown-preview-github-styles"
vscode "christian-kohler.path-intellisense"
vscode "darfka.vbscript"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "ics.japanese-proofreading"
vscode "james-yu.latex-workshop"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mr-konn.catex"
vscode "mr-konn.generic-input-method"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shuworks.vscode-table-formatter"
vscode "techer.open-in-browser"
vscode "tomoki1207.vscode-input-sequence"
vscode "torn4dom4n.latex-support"
vscode "vscode-icons-team.vscode-icons"
vscode "ziyasal.vscode-open-in-github"
vscode "znck.grammarly"

# ── 未分類 ────────────────────────────────────────────────────────────────────
brew "curl"
brew "libpq"
brew "zellij"
cask "claude"
cask "logitech-g-hub"
cask "microsoft-auto-update"
cask "mysides"
tap "mczachurski/wallpapper"
